{
  "title": "Resume",
  "madeIn": "Made in",
  "brazil": "Brazil",
  "presentation": {
    "aboutMe": "About me",
    "aboutMeValue": "If you want one of the people on your team with a great mix of soft and hard skills, it's worth talking to me 😁. I consider myself a person who practices empathy on a daily basis both with my teammates, as well as with the clients or end users of my work.",
    "availableLanguages": "Available languages"
  },
  "contacts": {
    "title": "Contact informations",
    "phone": {
      "accessibility": "Phone"
    }
  },
  "experiences": {
    "education": {
      "title": "Education",
      "graduation": {
        "period": "From 02/2018 Until 12/2021",
        "name": "Degree in Computer Science",
        "description": "At the Pontifical Catholic University of Minas Gerais (PUC Minas)."
      },
      "frontEndDev": {
        "period": "From 07/2018 Until 08/2018",
        "name": "Front-End Developer (140hrs)",
        "description": "Front-end Developer career completed at"
      },
      "microservicesApplications": {
        "period": "From 07/2020 Until now",
        "name": "Architecting and developing modern and scalable applications based on microservices (1000hrs+)(pt-br)",
        "introduction": "The course trains Full Cycle Developers capable of creating microservice ecosystems from scratch."
      },
      "interJava": {
        "period": "From 02/2021 Until 03/2021",
        "name": "Bootcamp Inter Java Developer (95hrs)",
        "description": "Bootcamp made on the Digital Innovation One platform with learning of various topics such as Spring Boot, JPA, Kafka, Cloud Stream, Postgres, Lombok, Schema Registry, CQRS, Quarkus, Kubernetes, AWS EKS, Tests, Messaging Architecture, BI, Data Warehouse, Big Data, Data Lake, DevOps."
      },
      "gftJava": {
        "period": "From 08/2021 Until 09/2021",
        "name": "Bootcamp GFT Java & AWS Developer (50hrs)",
        "description": "Bootcamp made on Digital Innovation One platform with learning of various topics such as Spring Boot, Spring Web MVC, Spring Cloud, Spring Web Flux, REST API, JPA, Lombok, Java 8+, Serverless, Tests."
      }
    },
    "projects": {
      "title": "Projects",
      "devOpsModule": {
        "period": "From 07/2020 Until 08/2020",
        "name": "DevOps Challenge",
        "description": "Challenges of the DevOps module of my <a href=\"https://drive.google.com/file/d/1bJnFxQPKgSsI30sCvW-KzYK4V5JWzgSs/view?usp=share_link\" target=\"_blank\" rel=\"noreferrer\">microservices course</a>. Nginx + Laravel + Redis + MySQL with docker-compose, Kubernetes and pipelines for continuous integration and continuous deployment in a Kubernetes Cluster on Google Cloud Platform."
      },
      "imageProcessing": {
        "period": "From 10/2020 Until 11/2020",
        "name": "Mammography images classifier",
        "description": "A Python program that uses neural networks to classify mammography exams and seeks to differentiate breast density in order to identify tumors or other problems."
      },
      "localizaLabs": {
        "period": "From 01/2021 Until 02/2021",
        "name": "Localiza Labs API (120hrs)",
        "description": "The Localiza Labs Academy was a program that selected, from thousands, 20 candidates for an intensive .NET training in 3 weeks with the development of a challenge at the end. This project was the <strong>winner 🏆</strong> in the backend area. We created a .NET 5 REST API with SQL Server, Kubernetes, CI/CD Azure DevOps, Docker-Compose and Unit Tests. <a href=\"https://drive.google.com/file/d/1E0Hf4IWn9TRrooU_zOka3t03pjf18ukF/view\" target=\"_blank\" rel=\"noreferrer\">Certificate</a>"
      },
      "ecommerceMicroservices": {
        "period": "From 09/2021 Until 09/2021",
        "name": "GFT Bootcamp - Spring Ecommerce Microservices",
        "description": "Microservices made with Spring Boot including Elasticsearch, Redis, Config Server, Service Discovery and a Gateway."
      },
      "webfluxStockQuote": {
        "period": "From 09/2021 Until 09/2021",
        "name": "GFT Bootcamp - Spring Webflux Stock Quote",
        "description": "Project made with Spring Boot, WebFlux, Project Reactor, Lombok, React, ChartJS."
      }
    },
    "experiences": {
      "title": "Experiences",
      "zup": {
        "period": "From 07/2023 Until Now",
        "name": "Senior Software Engineer - <a href=\"https://www.zupinnovation.com/\" target=\"_blank\" rel=\"noreferrer\">Zup Innovation</a>",
        "description": "I work in the insurance area of a client in the banking/finance sector. As I did many things, I will give just one example of a project:<br><span style=\"text-decoration: underline;\">Situation 1</span>: Many clients made the quote and started contracting an insurance proposal, but forgot to formalize the proposal (to formalize means agreeing with the proposal).<br><span style=\"text-decoration: underline;\">My task</span>: Design and implement a solution to schedule actions (e.g. email/communication) to be executed every 3 days after the proposal enters the awaiting formalization state.<br><span style=\"text-decoration: underline;\">Actions I took to complete the task</span>: 1 - Understand the microservices architecture of my team and where my solution should be placed. 2 - Research about the architecture of scheduling systems and what cloud services could be used for this purpose. 3 - Bring and discuss solutions with the team. 4 - Implement the solution chosen by the team.<br><span style=\"text-decoration: underline;\">Results</span>: It was not a requirement of the project to define and collect success metrics but I collected logs in production that showed that 17k insurance proposals were formalized in a period of 1 year because of these reminders.<br><span style=\"text-decoration: underline;\">Technologies involved</span>: TypeScript, Java, AWS Lambda, AWS ECS, AWS EventBridge Scheduler, AWS SNS/SQS, AWS DynamoDB."
      },
      "google": {
        "period": "From 01/2022 Until 05/2023",
        "name": "Software Engineer - <a href=\"https://about.google/\" target=\"_blank\" rel=\"noreferrer\">Google</a>",
        "description": "I worked within the Google Search product area as a software engineer maintaining Data Engineering solutions (eg Map/Reduce) that process billions of logs every day and help Google evaluate its own products through satisfaction surveys sent directly to real users (eg Google Opinion Rewards App). Technologies involved: C++, RPC/gRPC, Protocol Buffers, Java, Python and relational databases.<br>I also worked on some additional projects:<br><span style=\"text-decoration: underline;\">In the 1st project</span> I was responsible for creating routines that process billions of data points and generate tables that are later used to create dashboards that help monitor the health of an internal system (I created the dashboards too). All technologies involved are internal.<br><span style=\"text-decoration: underline;\">In the 2nd project</span> I was responsible for collaborating on the design of a feature where internal users can create UI components through configuration files and I created the entire front end that supports this architecture. Technologies involved: Google Cloud, React, GraphQL, TypeScript, JavaScript and Node.js.<br><span style=\"text-decoration: underline;\">In the 3rd project</span> I worked as front and back end developing UI components that help internal users build satisfaction surveys. Technologies involved: Google Cloud, C++, RPC/gRPC, Protocol Buffers, Kotlin, TypeScript, React, GraphQL, Node.js and relational databases."
      },
      "accenture": {
        "period": "From 04/2021 Until 01/2022",
        "name": "Application Development Analyst - <a href=\"https://www.accenture.com/\" target=\"_blank\" rel=\"noreferrer\">Accenture</a>",
        "description": "<span style=\"text-decoration: underline;\">In the 1st project</span>, I was assigned to understand a need of the SAP team and create a solution from scratch, including layout, frontend (React), backend (Node), database (Postgres) and infrastructure on AWS (EC2, S3 and RDS).<br><span style=\"text-decoration: underline;\">In the 2nd project</span>, I worked as a React front-end technical lead. Our mission was to improve the accessibility of several websites of a large healthcare company in Brazil. This involves testing screen readers, color contrast and other things described in the WCAG standards. I helped the team both in the development of tasks and in the organization of the project (Git Flow, Code Review, CI/CD Pipelines, Technical Refinement)."
      },
      "internIoasys": {
        "period": "From 02/2020 Until 02/2021",
        "name": "Full Stack Development Intern - <a href=\"https://ioasys.com.br/\" target=\"_blank\" rel=\"noreferrer\">Ioasys</a>",
        "description": "Participation in 2 development projects.<br><span style=\"text-decoration: underline;\">The last one</span>, a Ruby on Rails API with infrastructure on AWS (EC2, RDS and S3 with video upload), was the biggest challenge, as in 2 weeks I had to take over the project alone, and I was responsible for the infrastructure on AWS, the backend development, deploys and updates to the production database.<br><span style=\"text-decoration: underline;\">The penultimate</span>, a Node Serverless project using AWS Lambda, was an authentication integration via SAML 2.0. I was responsible for a good part of the project cycle: conception, technical meetings with the client, development, automated tests and deployment."
      },
      "webDevIntern": {
        "period": "From 03/2019 Until 12/2019",
        "name": "Web Development Intern - <a href=\"https://crc.pucminas.br/\" target=\"_blank\" rel=\"noreferrer\">My university (PUC Minas)</a>",
        "description": "Responsible for designing, developing, testing and deploying an internal application at the university where technicians could ping machines from various laboratories and find out about their status. Technologies: HTML, CSS, JavaScript, PHP, Laravel, MySQL, Docker, Nginx."
      }
    },
    "interests": {
      "title": "Languages, interests and hobbies",
      "english": {
        "name": "English",
        "description": "Able to speak, write, read and listen."
      },
      "portuguese": {
        "name": "Portuguese",
        "description": "Native"
      },
      "softwareEngineering": {
        "name": "Interest in Software Engineering in Projects",
        "description": "I'm always looking for use cases where I can learn and apply software engineering patterns to structure the system :D"
      },
      "artificialIntelligence": {
        "name": "Interest in Artificial Intelligence",
        "description": "Experience in image processing projects using Deep Learning. I am interested in learning more about Machine Learning and Deep Learning."
      }
    }
  }
}
