{
  "title": "Currículo",
  "madeIn": "Feito em",
  "brazil": "Brasil",
  "presentation": {
    "aboutMe": "Sobre mim",
    "aboutMeValue": "Comecei a programar em C quando tinha 12 anos e, desde então, apaixonei-me por essa atividade 💕. Hoje trabalho com desenvolvimento de backend e frontend, sistemas distribuídos, mensageria, microsserviços, AWS, Docker, NodeJS, TypeScript e Java.",
    "availableLanguages": "Idiomas disponíveis"
  },
  "contacts": {
    "title": "Informações de contato",
    "phone": {
      "accessibility": "Telefone"
    }
  },
  "experiences": {
    "education": {
      "title": "Formação",
      "graduation": {
        "period": "02/2018 - 12/2021",
        "name": "Graduação em Ciência da Computação",
        "description": "Na Pontifícia Universidade Católica de Minas Gerais (PUC Minas)."
      },
      "frontEndDev": {
        "period": "07/2018 - 08/2018",
        "name": "Desenvolvedor Front-End (140hrs)",
        "description": "Carreira Desenvolvedor Front-end concluída na"
      },
      "fullCycle": {
        "period": "07/2020 - Presente",
        "name": "Curso Full Cycle (microsserviços) (1000hrs+)",
        "description": "O curso ensina desde a análise de domínios de uma empresa até o desenvolvimento, deploy e monitoramento de um ecossistema de microsserviços."
      },
      "interJava": {
        "period": "02/2021 - 03/2021",
        "name": "Bootcamp Inter Java Developer (95hrs)",
        "description": "Bootcamp feito na plataforma da Digital Innovation One com aprendizado de vários tópicos como Spring Boot, JPA, Kafka, Cloud Stream, Postgres, Lombok, Schema Registry, CQRS, Quarkus, Kubernetes, AWS EKS, Tests, Arquitetura de mensageria, BI, Data Warehouse, Big Data, Data Lake, DevOps."
      },
      "gftJava": {
        "period": "08/2021 - 09/2021",
        "name": "Bootcamp GFT Java & AWS Developer (50hrs)",
        "description": "Bootcamp feito na plataforma da Digital Innovation One com aprendizado de vários tópicos como Spring Boot, Spring Web MVC, Spring Cloud, Spring Web Flux, API REST, JPA, Lombok, Java 8+, Serverless, Tests."
      },
      "neuralNetworks": {
        "period": "07/2021 - 07/2021",
        "name": "Neural Networks and Deep Learning",
        "description": "Um curso da DeepLearning.AI oferecido pela Coursera sobre blocos de construção de redes neurais, redes neurais rasas e redes neurais profundas."
      },
      "localizaLabs": {
        "period": "01/2021 - 02/2021",
        "name": "Localiza Labs API (120hrs)",
        "description": "O Localiza Labs Academy foi um programa que selecionou, dentre milhares, 20 candidatos para um treinamento intensivo de C# e .NET em 3 semanas tendo desenvolvimento de um desafio no final. Esse projeto foi o <strong>vencedor 🏆</strong> na área de backend. Criei uma API REST em C# usando .NET 5 com SQL Server, Kubernetes, CI/CD Azure DevOps, Docker-Compose e Unit Tests. <a href=\"https://drive.google.com/file/d/1E0Hf4IWn9TRrooU_zOka3t03pjf18ukF/view\" target=\"_blank\" rel=\"noreferrer\">Certificado</a>"
      }
    },
    "projects": {
      "title": "Projetos",
      "devOpsModule": {
        "period": "07/2020 - 08/2020",
        "name": "Desafio de DevOps",
        "description": "Desafios do módulo de DevOps do meu <a href=\"https://drive.google.com/file/d/1bJnFxQPKgSsI30sCvW-KzYK4V5JWzgSs/view?usp=share_link\" target=\"_blank\" rel=\"noreferrer\">curso de microsserviços</a>. Nginx + Laravel + Redis + MySQL com docker-compose, Kubernetes e pipelines de integração contínua e deploy contínuo num Cluster Kubernetes no Google Cloud Platform."
      },
      "imageProcessing": {
        "period": "10/2020 - 11/2020",
        "name": "Classificador de imagens de mamografia",
        "description": "Um programa feito em Python que usa redes neurais para classificar imagens de exames mamográficos e busca diferenciar a densidade das mamas no intuito de identificar tumores ou outros problemas."
      },
      "localizaLabs": {
        "period": "01/2021 - 02/2021",
        "name": "Localiza Labs API (120hrs)",
        "description": "O Localiza Labs Academy foi um programa que selecionou, dentre milhares, 20 candidatos para um treinamento intensivo de C# e .NET em 3 semanas tendo desenvolvimento de um desafio no final. Esse projeto foi o <strong>vencedor 🏆</strong> na área de backend. Criei uma API REST em C# usando .NET 5 com SQL Server, Kubernetes, CI/CD Azure DevOps, Docker-Compose e Unit Tests. <a href=\"https://drive.google.com/file/d/1E0Hf4IWn9TRrooU_zOka3t03pjf18ukF/view\" target=\"_blank\" rel=\"noreferrer\">Certificado</a>"
      },
      "ecommerceMicroservices": {
        "period": "09/2021 - 09/2021",
        "name": "GFT Bootcamp - Spring Ecommerce Microservices",
        "description": "Microsserviços feitos com Spring Boot incluindo Elasticsearch, Redis, Config Server, Service Discovery e um Gateway."
      },
      "webfluxStockQuote": {
        "period": "09/2021 - 09/2021",
        "name": "GFT Bootcamp - Spring Webflux Stock Quote",
        "description": "Projeto que simula o acompanhamento de ações e seus valores de abertura e fechamento feito com Spring Boot, WebFlux, Project Reactor, Lombok, React, ChartJS."
      }
    },
    "experiences": {
      "title": "Experiências",
      "zup": {
        "period": "07/2023 - Presente",
        "name": "Senior Software Engineer - <a href=\"https://www.zupinnovation.com/\" target=\"_blank\" rel=\"noreferrer\">Zup Innovation</a>",
        "description": "Eu trabalho na área de seguros de um cliente do setor bancário/financeiro com microsserviços em Java Spring Boot e TypeScript NodeJS.<br><strong>Projeto 1</strong>: Aumentar o número de propostas de seguro contratadas. A abordagem foi baseada em lembretes agendados. Desenhei a arquitetura, levei para discussão com a equipe e desenvolvi a solução. No período de 1 ano, 17 mil propostas de seguro foram formalizadas graças aos lembretes. Tecnologias: TypeScript, NodeJS, Java, Apache Kafka, AWS DynamoDB, AWS Lambda, AWS ECS, AWS EventBridge Scheduler, AWS SNS, AWS SQS.<br><strong>Projeto 2</strong>: Extrair dados de propostas de seguro do nosso banco de dados e salvá-los em um bucket S3 particionado para que a equipe de dados e analytics possa realizar consultas SQL no Amazon Athena. O resultado desse projeto é a democratização dos dados e a possibilidade de descobrir novos insights sobre o negócio. Tecnologias: AWS DynamoDB, DynamoDB Streams, AWS Lambda, AWS Step Functions, AWS EventBridge Scheduler, AWS Glue, Apache Spark, Python, Terraform, CI/CD, Grafana, Prometheus.<br><strong>Projeto 3</strong>: Permitir que o meu time teste coisas novas no ambiente de desenvolvimento. O contexto desse problema é que nós só conseguíamos testar coisas depois de implantá-las em ambiente de homologação, e isso não é o ideal. Meu trabalho era revisar toda a arquitetura de microsserviços do time e montar um plano para ajustar todas as aplicações e fazê-las funcionar no ambiente de desenvolvimento. O resultado desse projeto foi um aumento na produtividade do time, pois ele conseguiu iterar mais rápido em novos desenvolvimentos."
      },
      "google": {
        "period": "01/2022 - 05/2023",
        "name": "Software Engineer - <a href=\"https://about.google/\" target=\"_blank\" rel=\"noreferrer\">Google</a>",
        "description": "Trabalhei na área de produtos do Google Search mantendo soluções de engenharia de dados (semelhantes ao Google Flume, Google Dataflow, Apache Beam, Apache Flink) que processam bilhões de logs todos os dias e ajudam o Google a avaliar seus próprios produtos por meio de pesquisas de satisfação enviadas diretamente a usuários reais (por exemplo, Google Opinion Rewards App).<br>Também trabalhei em alguns projetos adicionais:<br><strong>Projeto 1</strong>: Fui responsável por criar jobs agendados que processam bilhões de data points e geram tabelas que são usadas posteriormente para criar dashboards que ajudam a monitorar a integridade de um sistema interno. Tecnologias: Python, SQL e algumas outras internas (semelhantes às métricas do Prometheus).<br><strong>Projeto 2</strong>: Desenvolvi componentes de front-end e back-end que ajudam os usuários internos a criar pesquisas de satisfação com mais facilidade sem precisar saber os detalhes da pipeline de engenharia de dados da minha equipe. Esse projeto reduziu o tempo de criação de pesquisas de satisfação de horas para minutos e também ajudou a aumentar a adoção da ferramenta que a minha equipe oferece. Tecnologias: Kotlin, C++, RPC/gRPC, Protocol Buffers, Blaze/Bazel, Google Cloud, TypeScript, JavaScript, NodeJS, React, GraphQL, Apollo, banco de dados relacional."
      },
      "accenture": {
        "period": "04/2021 - 01/2022",
        "name": "Application Development Analyst - <a href=\"https://www.accenture.com/\" target=\"_blank\" rel=\"noreferrer\">Accenture</a>",
        "description": "<strong>Projeto 1</strong>: Fui designado a entender uma necessidade do time de SAP da Accenture e criar uma solução do zero, incluindo layout, frontend (React), backend (Node), banco de dados (Postgres) e infraestrutura na AWS (EC2, S3 e RDS). Esse projeto permitiu que a equipe SAP registrasse projetos criados no passado e os procurasse rapidamente para reutilizá-los em novos projetos.<br><strong>Projeto 2</strong>: Trabalhei como líder técnico de front-end React. Nossa missão era melhorar a acessibilidade de vários sites de uma grande empresa da área de saúde no Brasil. Isso envolve testar leitores de tela, contraste de cores e outras coisas descritas nos padrões WCAG. Nosso cliente usou evidências geradas durante o projeto para responder a um processo legal e nos deu um feedback positivo sobre a qualidade do projeto e o andamento do processo legal. Tecnologias: JavaScript, React, NodeJS, Azure DevOps, CI/CD, Git Flow, WCAG, Refinamento Técnico."
      },
      "internIoasys": {
        "period": "02/2020 - 02/2021",
        "name": "Estagiário de Desenvolvimento Full Stack - <a href=\"https://ioasys.com.br/\" target=\"_blank\" rel=\"noreferrer\">Ioasys</a>",
        "description": "<strong>Projeto 1</strong>: Desenvolvi uma integração de autenticação via SAML 2.0 usando NodeJS e AWS Lambda. Esse projeto permitiu integrar um novo cliente ao nosso projeto através do Azure Active Directory dele.<br><strong>Projeto 2</strong>: Eu era um desenvolvedor de uma API Ruby on Rails que funciona como um aplicativo de mídia social empresarial. Esse foi um grande desafio, porque em 2 semanas eu tive que assumir o projeto sozinho (como estagiário!!) e era responsável pela infraestrutura na AWS, o desenvolvimento do backend, implantações e migrações de esquema no banco de dados de produção. Tecnologias: Ruby, Ruby on Rails, Active Record, AWS EC2, AWS RDS (MySQL), AWS S3, Nginx, certificados SSL/TLS, SSH."
      },
      "webDevIntern": {
        "period": "03/2019 - 12/2019",
        "name": "Estagiário de Desenvolvimento Web - <a href=\"https://crc.pucminas.br/\" target=\"_blank\" rel=\"noreferrer\">PUC Minas</a>",
        "description": "Desenvolvi uma aplicação interna na universidade onde os técnicos podiam pingar máquinas de vários laboratórios e descobrir o status delas. Tecnologias: HTML, CSS, JavaScript, PHP, Laravel, MySQL, Docker, Nginx."
      }
    },
    "interests": {
      "title": "Idiomas, interesses e hobbies",
      "english": {
        "name": "Inglês",
        "description": "Capaz de falar, escrever, ler e ouvir."
      },
      "portuguese": {
        "name": "Português",
        "description": "Nativo"
      },
      "softwareEngineering": {
        "name": "Interesse em Engenharia de Software em Projetos",
        "description": "Estou sempre buscando casos de uso onde eu possa aprender e aplicar padrões de engenharia de software para estruturar um sistema :D"
      },
      "artificialIntelligence": {
        "name": "Interesse em Inteligência Artificial",
        "description": "Experiência em projetos de processamento de imagens com o uso de Deep Learning. Tenho interesse em aprender mais sobre Machine Learning e Deep Learning."
      }
    }
  }
}
